--------------------------------------------------------------------------------------------
--------------------------------------------Info--------------------------------------------
--------------------------------------------------------------------------------------------
/*список предупреждений*/
select * from msdb..sysalerts

/*список уведомлений*/
select * from msdb..sysnotifications

/*список операторов, те кто получает сообщения от DB Mail*/
select * from msdb..sysoperators


--------------------------------------------------------------------------------------------
-----------------------------------------Maintaince-----------------------------------------
--------------------------------------------------------------------------------------------
/*создание нового оператора*/
EXEC msdb.dbo.sp_add_operator 
	@name = N'SQL_Alerts' 
	, @enabled = 1 
	, @email_address = N'my_email@mail.com';



EXEC msdb.dbo.sp_add_alert 
	@name = N'Severity 19 Error' 
	, @enabled = 1 -- 1 по ум
	, @message_id = 0 -- 0 по ум.; номер ошибки; если используется серьезность ошибки (@severity = ..), то д.б. равно 0 
	, @severity = 19  -- уровень серьезности ошибки (1-25)
	, @include_event_description_in = 0;
 
EXEC msdb.dbo.sp_add_notification @alert_name = N'Severity 19 Error', 
  @operator_name = N'SQL_Alerts', @notification_method = 1;
